from interpreter import Interpreter

code = """
س = [10,20,30]
ص = [20,40,60]
الميل = 1
التحيز = 1
عدد_التدريب = 10
التدريب = 0

دالة تدريب():
    كرر:
        إذا التدريب < عدد_التدريب:
            التدريب += 1
            نتيجة_التنبؤ = []
            كرر:
                إذا نتيجة_التنبؤ.طول < س.طول:
                    المعادلة = الميل*س[نتيجة_التنبؤ.طول] + التحيز
                    نتيجة_التنبؤ.ضف(المعادلة)
            اطبع "هنا لا يكمل الكود"
            المرات = 0
            خطأ = 0
            كرر:
                إذا س.طول < المرات:
                    خطأ += س[المرات] - نتيجة_التنبؤ[المرات]
                    المرات += 1
            نتيجة_الخطا = خطأ / س.طول
            اطبع نتيجة_الخطا

تدريب()
"""

interpreter = Interpreter()
interpreter.execute(code)
