from interpreter import Interpreter
code = """
س = [10,20,30]
ص = [20,40,60]
الميل = 1 
التحيز = 0
عدد_التدريب = 10
التعلم = 0.001
التدريب = 0
دالة تدريب():
    كرر:
        إذا التدريب < عدد_التدريب:
            التدريب += 1
            نتيجة_التنبؤ = []
            كرر:
                إذا نتيجة_التنبؤ.طول < س.طول:
                    المعادلة = (الميل*س[نتيجة_التنبؤ.طول]) + التحيز
                    نتيجة_التنبؤ.ضف(المعادلة)        
            المرات = 0
            المشتقة_الميل = 0
            المشتقة_التحيز = 0
            خطأ = 0
            كرر:
                إذا المرات < س.طول:
                    نتيجة_الخطا = ص[المرات] - نتيجة_التنبؤ[المرات)
                    اطبع نتيجة_الخطا 
                    المشتقة_الميل += نتيجة_الخطا * س[المرات]
                    المشتقة_التحيز += نتيجة_الخطا
                    المرات += 1 
            المشتقة_الميل = (-2/س.طول) * المشتقة_الميل
            المشتقة_التحيز = (-2/س.طول)
            الميل = الميل - التعلم * المشتقة_الميل
            التحيز = التحيز - التعلم * المشتقة_التحيز
            اطبع الميل
تدريب()
"""
interpreter = Interpreter()
interpreter.execute(code)
