from interpreter import Interpreter

code = """
س = [10,20,30]
ص = [20,40,60]
الميل = 1 
التحيز = 0
عدد_التدريب = 100
# معدل التعلم 0.1 كبير جداً على أرقام تصل إلى 30 وسيؤدي إلى انفجار (inf-)
التعلم = 0.001
التدريب = 0

دالة تدريب():
    كرر:
        إذا التدريب < عدد_التدريب:
            التدريب += 1
            نتيجة_التنبؤ = []
            كرر:
                إذا نتيجة_التنبؤ.طول < س.طول:
                    المعادلة = (الميل*س[نتيجة_التنبؤ.طول]) + التحيز
                    نتيجة_التنبؤ.ضف(المعادلة)        
            المرات = 0
            المشتقة_الميل = 0
            المشتقة_التحيز = 0
            كرر:
                إذا المرات < س.طول:
                    الفرق = ص[المرات] - نتيجة_التنبؤ[المرات]
                    المشتقة_الميل += الفرق * س[المرات]
                    المشتقة_التحيز += الفرق
                    المرات += 1 
            
            المشتقة_الميل = (-2/س.طول) * المشتقة_الميل
            المشتقة_التحيز = (-2/س.طول) * المشتقة_التحيز
            
            الميل = الميل - (التعلم * المشتقة_الميل)
            التحيز = التحيز - (التعلم * المشتقة_التحيز)
    اطبع "الميل النهائي:"
    اطبع الميل
    اطبع "التحيز النهائي:"
    اطبع التحيز

تدريب()
"""

interpreter = Interpreter()
interpreter.execute(code)
